{
  "experiences": [
    {
      "id": 185492,
      "position": "Computer Engineering Instructor",
      "company": "Holy Angel University",
      "company_url": "https://hau.edu.ph",
      "location": "Angeles City, Philippines",
      "start_date": "Aug 2023",
      "end_date": "Present",
      "desc": [
        "As a devoted Computer Engineering instructor, I provide comprehensive instruction in crucial subjects like JavaScript for Web Development, Python for Data Visualization, and Data Analysis and Analytics for Data Science, while also fostering the intellectual and professional growth of my students through dedicated mentorship, guidance, and active participation in their career development."
      ],
      "skills": [
        "Data Visualization", "GitHub", "Data Analytics", "Software Development", "Vercel", "Python", "Front-End Development", "UI Design", "Tailwind CSS", "Web Development", "React.js", "JavaScript"
      ]
    },
    {
      "id": 185494,
      "position": "Software Developer",
      "company": "Kooest",
      "company_url": "https://kooest.com",
      "location": "Mabalacat City, Philippines",
      "start_date": "Jun 2023",
      "end_date": "Present",
      "desc": [
        "As a principal full-stack developer at a bespoke digital solutions agency, I've successfully designed and deployed a secure, high-performance website for a UAE-based construction agency using TypeScript and Next.js. My approach leverages Vercel for global availability and incorporates custom open-source packages to deliver unique, client-specific experiences. I am committed to consistently delivering an optimal blend of aesthetics and robust functionality in web development projects, while integrating advanced technologies for scalable, future-ready solutions."
      ],
      "skills": [
        "GitHub", "PostgreSQL", "Software Development", "Vercel", "Python", "Full-Stack Development", "Tailwind CSS", "Web Development", "React.js", "JavaScript", "TypeScript", "Next.js"
      ]
    },
    {
      "id": 9,
      "position": "Technical Associate",
      "company": "Holy Angel University",
      "company_url": "https://hau.edu.ph",
      "location": "Angeles City, Philippines",
      "start_date": "Sep 2021",
      "end_date": "Dec 2022",
      "desc": [
        "In my role, I've successfully secured ₱17.9 million in funding for technology transfer and R&D projects, led the development of services for idea protection and commercialization, and managed effective marketing initiatives that boosted brand recognition and customer engagement. My technical support has facilitated the high-quality completion of unit programs and projects, while my communication strategies have improved customer satisfaction and retention. I've also increased operational efficiency by 25% through the development of a database management system and boosted website traffic by 45% by designing a user-friendly website using Django and PostgreSQL. The deployment of this website via Digital Ocean's web services has reduced downtime by 90%, and the utilization of advanced technologies has improved user satisfaction by 30%."
      ],
      "skills": [
        "GitHub", "PostgreSQL", "Software Development", "Relational Databases", "Python", "Full-Stack Development", "Project Management", "Web Development", "Django", "Digital Ocean"
      ]
    },
    {
      "id": 112354,
      "position": "Back End Developer",
      "company": "Encephalon Holy Angel University - Technology Business Incubator",
      "company_url": "https://hau.edu.ph",
      "location": "Angeles City, Philippines",
      "start_date": "Oct 2020",
      "end_date": "Feb 2022",
      "desc": [
        "As a developer, I've successfully handled both backend infrastructure and frontend development for two government-owned websites, serving thousands of users. My deployment of projects via AWS and Digital Ocean web services has ensured a 99.9% uptime rate. By implementing software development best practices, I've increased team productivity by 20%. Furthermore, my coordination with a diverse team of engineers, programmers, and designers has ensured timely delivery of high-standard projects, achieving a customer satisfaction rate of 95%."
      ],
      "skills": [
        "GitHub", "PostgreSQL", "Software Development", "Relational Databases", "Python", "JavaScript", "Full-Stack Development", "Project Management", "Web Development", "Django", "Digital Ocean", "Amazon Web Services (AWS)"
      ]
    },
    {
      "id": 8567472,
      "position": "Junior Software Engineer",
      "company": "JDEV Office Solution Incorporated",
      "company_url": "",
      "location": "Angeles City, Philippines",
      "start_date": "Jul 2021",
      "end_date": "Sep 2021",
      "desc": [
        "In collaboration with a team of engineers, programmers, and designers, I designed and developed a modern, user-friendly website for a car services company using VueJS, TailwindCSS, and JavaScript frameworks. This project not only resulted in a 20% increase in website traffic but also improved customer conversions by 15%. I ensured the successful execution and delivery of the website by implementing best practices in engineering, programming, and design."
      ],
      "skills": [
        "Software Development", "UI Design", "Vue.js", "Tailwind CSS", "Web Development", "JavaScript"
      ]
    },
    {
      "id": 856745,
      "position": "Software Quality Assurance",
      "company": "JDEV Office Solution Incorporated",
      "company_url": "",
      "location": "Angeles City, Philippines",
      "start_date": "May 2019",
      "end_date": "Oct 2019",
      "desc": [
        "In my role, I've successfully implemented a user interface review process, reviewing over 50 interfaces for functionality and design guideline adherence. I've tested various web and standalone applications, including custom client-server applications, to ensure proper functionality. Furthermore, I've designed frontend web applications' interfaces, now used company-wide, to improve functionality and user experience."
      ],
      "skills": [
        "UI Design", "Quality Assurance"
      ]
    }
  ]
}